[
  {
    "name": "Healthy",
    "description": "Plants are vigorous and photosynthesis is optimal. Focus is on prevention, balanced nutrition, and maintaining a strong canopy.",
    "organic_treatment": "Today:\n• Apply humic acid (12%) @ 2 ml/L as root drench to promote root growth.\nWeekly:\n• Apply Trichoderma viride @ 5 g/L as soil drench or spray to keep soil microflora healthy.\nDaily:\n• Maintain 5 cm organic mulch around plants to conserve moisture.\n• Remove suckers up to the first V-fork to maintain a well-ventilated canopy.",
    "chemical_treatment": "Today:\n• Spray NPK 19:19:19 @ 5 g/L + micronutrient mixture @ 2 ml/L as foliar feed.\nFlowering stage:\n• Switch to 0:52:34 @ 5 g/L to support flowering and fruit set.\nWeekly:\n• Apply calcium nitrate @ 5 g/L (foliar or fertigation) to strengthen cell walls.\nAlways:\n• After fertigation, flush lines with clean water for 30 minutes to prevent salt build‑up.",
    "yield_advice": "• Maintain an open canopy by removing excess inner shoots.\n• Check EC (1.8–2.2) and pH (6.0–6.5) of irrigation water/solution once per week.\n• Harvest fruits regularly at correct maturity to keep plants in continuous production.",
    "follow_up": "Frequency:\n• Check the field every 7–10 days during normal weather.\n• Increase checks to every 3–4 days after heavy rain or strong winds.\nWhat to monitor:\n• Uniform green color of leaves without spots, yellowing, or curling.\n• New flush of leaves and flowers forming regularly.\n• Absence of insect pests on the underside of leaves and tender shoots.\nActions:\n• If any minor spots or yellowing patches appear, tag those plants for closer observation.\n• Adjust irrigation if soil stays too wet or too dry around the root zone.\n• Record plant vigor and flowering intensity in a simple field notebook or app."
  },
  {
    "name": "Bacterial Spot",
    "description": "Systemic bacterial infection causing water-soaked necrotic spots. Spreads rapidly via water splashing.",
    "organic_treatment": "Immediately:\n• Stop overhead irrigation; switch to drip or furrow irrigation only.\nToday:\n• Spray Pseudomonas fluorescens @ 5 ml/L uniformly on foliage.\n• Remove heavily infected leaves and dispose of them outside the field; disinfect tools between cuts.\nDaily (during active infection):\n• Avoid field operations when leaves are wet to prevent spreading bacteria.\n• Keep the crop area weed‑free to reduce alternate hosts and humidity.",
    "chemical_treatment": "Day 1:\n• Spray Copper Hydroxide @ 2 g/L + Streptocycline @ 0.1 g/L.\nDay 3–4:\n• Rotate to Copper Oxychloride @ 2 g/L + Kasugamycin @ 2 ml/L.\nRepeat interval:\n• Repeat sprays every 5–7 days if new spots continue to appear.\nNotes:\n• Avoid more than 2–3 consecutive copper + antibiotic sprays to reduce resistance and residue issues.\n• Always follow pre‑harvest intervals (PHI) mentioned on labels.",
    "yield_advice": "• Stop nitrogen‑rich fertilizers immediately to prevent soft growth; switch to Potash (0:0:50) @ 5 g/L to harden tissues.\n• Remove worst‑affected rows early if infection is severe to protect the remaining area.",
    "follow_up": "Frequency:\n• First detailed review 3 days after the initial spray.\n• Subsequent checks every 5–7 days until no new lesions appear.\nWhat to monitor:\n• Number of new spots on young leaves compared to previous visit.\n• Presence of water‑soaked halos or coalescing lesions.\nActions if improving:\n• Continue rotation of recommended sprays at 7‑day interval.\n• Gradually reintroduce balanced nutrition while avoiding excess nitrogen.\nActions if not improving:\n• Shorten spray interval to 5 days and review spray coverage and water quality.\n• Consider removing severely affected plants or patches to stop spread."
  },
  {
    "name": "Early Stage",
    "description": "Localized spots appearing on lower leaves. Recovery is highly likely with immediate copper-based protection.",
    "organic_treatment": "Evening or early morning:\n• Spray azadirachtin (10,000 ppm) @ 2 ml/L as a preventive bio‑bacterial and insect deterrent.\nAs soon as possible:\n• Plant marigold or other trap crops on borders to reduce pest pressure.\nWeekly:\n• Apply seaweed extract as per label recommendation to support stress tolerance.\nDaily:\n• Remove a few badly affected leaves per plant without heavy pruning to maintain photosynthesis.",
    "chemical_treatment": "Today:\n• Spray Copper Oxychloride @ 2 g/L + silicon‑based spreader @ 0.5 ml/L for protective coverage.\nAfter 5 days:\n• Rotate to Streptocycline @ 0.1 g/L to stop bacterial multiplication.\nIf sucking pests are present:\n• Apply imidacloprid 17.8 SL @ 0.3 ml/L (avoid peak flowering to protect pollinators).",
    "yield_advice": "• Keep soil moist but allow the top 1–2 cm to dry slightly between irrigations.\n• Apply amino‑acid tonic @ 2 ml/L once per week to help plants recover.\n• Reduce nitrogen application slightly while maintaining adequate potassium and calcium.\n• Scout the field at least twice per week for any increase in lesion size or number.",
    "follow_up": "Frequency:\n• Inspect the crop every 3 days for the next 2 weeks.\nWhat to monitor:\n• Whether existing lesions are staying the same size, shrinking, or expanding.\n• Appearance of new lesions on previously clean leaves.\nActions if stable or improving:\n• Continue the recommended rotation of bactericides.\n• Gradually return to the normal fertilizer schedule while keeping good airflow in the canopy.\nActions if worsening:\n• Reclassify the block as Mid Stage and switch to the Mid Stage chemical and organic protocol.\n• Mark severely affected rows with flags for closer monitoring."
  },
  {
    "name": "Mid Stage",
    "description": "Infection is spreading to the middle canopy. Requires aggressive bactericide rotation and strict hygiene.",
    "organic_treatment": "Immediately:\n• Prune leaves or shoots with more than 40% damage and remove them from the field.\nToday:\n• Drench beneficial microbes (Bacillus subtilis or Trichoderma spp.) around the root zone to support soil health.\nWeekly:\n• Maintain a layer of organic mulch to stabilize soil moisture and temperature.\nDaily:\n• Ensure strong airflow between rows and strictly avoid overhead irrigation.",
    "chemical_treatment": "Day 1:\n• Spray Kasugamycin 3% SL @ 2 ml/L OR Validamycin @ 2 ml/L as antibiotic.\nDay 5:\n• Rotate to Copper Hydroxide @ 2 g/L + Streptocycline @ 0.1 g/L.\nDay 10:\n• Apply Copper Oxychloride @ 2 g/L to provide protective coverage on new growth.\nIf insect vectors are present:\n• Apply acetamiprid @ 0.5 g/L to reduce secondary spread.",
    "yield_advice": "• Spray magnesium sulfate (Epsom salt) @ 5 g/L if yellowing between veins is visible.\n• During flowering, add boron 20% @ 1 g/L to support fruit set.\n• 3–4 days after each major chemical round, apply a mild micronutrient + amino‑acid feed.",
    "follow_up": "Frequency:\n• Inspect the field every 3–4 days until the disease is clearly under control.\nWhat to monitor:\n• Percentage of canopy affected in each plot or row.\n• Rate of appearance of new lesions on young leaves and stems.\nActions if improving:\n• Maintain the chemical rotation but gradually extend the interval to 7 days.\n• Focus on nutrition that supports recovery (potassium, calcium, magnesium).\nActions if not improving or spreading fast:\n• Treat the area as Advanced Stage.\n• Consider removing heavily affected patches to protect nearby healthy plants."
  },
  {
    "name": "Advanced Stage",
    "description": "Large patches of the canopy are damaged, with heavy defoliation and major yield loss. Management focuses on salvage and preventing spread to new blocks.",
    "organic_treatment": "Immediately:\n• Uproot and destroy severely affected plants that have little chance of recovery.\nToday:\n• Drench removed spots or pits with a mild disinfectant solution or bleaching powder (after a small safety test).\nNext season:\n• Plan soil solarization, crop rotation, or cover crops to reduce inoculum levels.\nAlways:\n• Clean tools, containers, and footwear before entering healthy blocks to avoid carrying spores.",
    "chemical_treatment": "Today:\n• Spray high dose of Copper Hydroxide @ 3 g/L + Streptocycline @ 0.2 g/L thoroughly on remaining plants.\nEvery 4–5 days:\n• Repeat sprays until no new lesions appear on fresh growth.\nIf soft rot or bacterial ooze is present:\n• Add Kasugamycin 3% SL @ 2 ml/L in the spray tank.\nStop when:\n• No new lesions appear for at least 7 consecutive days and existing lesions are dry and inactive.",
    "yield_advice": "• Remove small, deformed, or unmarketable fruits so the plant can focus resources on remaining marketable fruits.\n• Increase potassium and phosphorus supply while reducing nitrogen to harden tissues.\n• Harvest all possible fruits quickly before quality declines further.\n• If more than 60–70% of plants in a block reach Advanced Stage, plan to terminate that block and replant with a clean crop after sanitation.",
    "follow_up": "Frequency:\n• Check the field daily for the next 7–10 days.\n• After the situation stabilizes, reduce monitoring to every 3–4 days.\nWhat to monitor:\n• Whether new infections are appearing in previously healthy rows.\n• Progression of lesions on stems and fruits, not just leaves.\nActions:\n• If spread continues despite full protocol, prioritize saving border rows and nearby healthy blocks.\n• Mark blocks that need termination and schedule removal and deep burial or burning as per local regulations.\n• Document dates of each inspection, spray, and plant removal to guide decisions in the next season."
  }
]